[
    {
        "comment": "Ask about anything about the game that doesn't necessarily require a dedicated thread.\n\nThat is, if your question can be answered rather quickly/without significant  difficulty (e.g. \"Can my phone run this game?\"), ask here. If you think your question can contribute to some constructive discussions (e.g. \"What do you think of Amber's combat efficiency? Here's my opinion.\"),  make a particular post with the \"discussion\" flair.\n\n## Other megathreads:\n\n\n* [**Weekly Friend Request Megathread**](https://www.reddit.com/r/Genshin_Impact/search?q=title%3A%22Weekly+Friend+Request+Megathread%22+author%3AVeritasibility&restrict_sr=on&sort=new&t=week) \\- Find some friends!\n* [**Weekly Gacha and Drops Megathread**](https://www.reddit.com/r/Genshin_Impact/search?q=title%3A%22Weekly+Gacha+and+Drops+Megathread%22+author%3AVeritasibility&restrict_sr=on&sort=new&t=week) \\- The thread where you can share the results of your gacha rolls and lucky drops.\n* [**Weekly Team/Character Building Megathread**](https://www.reddit.com/r/Genshin_Impact/search/?q=title:%22Character%20Building%20Megathread%22%20author:Veritasibility&restrict_sr=1&sort=new) \\- Ask about team-building or Character-building!",
        "date": "2024-01-29T04:01:03"
    },
    {
        "comment": "Does Raiden need an electro goblet? My current Raiden has 108 electro dmg bonus with 254 ER(ATK sands). So should I change the goblet for an ATK one?\n\n\nI just got her so I'm full of doubts😅\n\nThanks in advance 😃",
        "date": "2024-01-29T13:45:07"
    },
    {
        "comment": "Teams that provide plenty of ATK buffs prefer an Electro DMG Bonus Goblet whereas teams that provide plenty of DMG% buffs in addition to Raiden’s built-in DMG% buffs (e.g., her Skill, her A4) prefer an ATK% Goblet. In most cases, an Electro DMG Bonus Goblet is preferred.",
        "date": "2024-01-29T13:52:01"
    },
    {
        "comment": "electro",
        "date": "2024-01-29T14:53:30"
    },
    {
        "comment": "Raiden frequently needs an optimizer to get a correct answer.\n\nRule of thumb is that without Engulfing Lightning, use an ATK goblet.  With Engulfing, run an Electro goblet.",
        "date": "2024-01-29T13:47:35"
    },
    {
        "comment": "Electro Goblets are generally better even without Engulfing Lightning because Raiden gets a lot of ATK from Bennett",
        "date": "2024-01-29T14:18:04"
    },
    {
        "comment": ">without Engulfing Lightning\n\nWith ER sands? And the circlet should still be crit right?",
        "date": "2024-01-29T13:48:58"
    },
    {
        "comment": "Most builds assume an ER sands.  If you can still hit 220ish ER without an ER sands due to really good ER substat rolls, probably an ATK sands/Electro goblet.  Again, optimizer is the only way to get a definitive answer.\n\nThe ER -> Electro DMG talent makes Raiden kind of funky that way.  And yes, crit circlet.  That's way without Engulfing you only aim for 220 ER - more than that and you are sacrificing too many crit stats.",
        "date": "2024-01-29T13:51:01"
    },
    {
        "comment": ">Most builds assume an ER sands\n\nI'd doubt that lol. Without EL, I'd imagine most people are on Catch. ER sands on Catch is a scuffed build. At 250 ER with an atk sands I'd absolutely stay on ATK",
        "date": "2024-01-29T14:08:01"
    },
    {
        "comment": "Not really, no.  Most builds recommend 220% ER, minimum about 200%.  The Catch is only about 50%.  Trying to make up 50% ER just from substats is kind of reaching for all but the people spending weeks just building her - at least not without really hamstringing how much crit you have.  With ER sands you can either ignore ER substats or just go for an additional 20, so you can focus entirely on crit and ATK stats.",
        "date": "2024-01-29T14:10:47"
    },
    {
        "comment": "She also has er ascension and emblem 2pc. The minimum er catch raiden has is 198 er. Where are you getting 50% er from subs?",
        "date": "2024-01-29T14:15:07"
    },
    {
        "comment": "Yeah, 60%+ is from substats, is it too much?",
        "date": "2024-01-29T14:44:24"
    },
    {
        "comment": "Yeah, she doesn't need that much. You can switch from an er sands to atk sands, although its best to use an optimizer.",
        "date": "2024-01-29T14:48:00"
    },
    {
        "comment": ">er sands to atk sands\n\nShe is using an atk sand, I did get a good ER sand when I pre- farmed for her, but got lucky in the first few ones I got 😁\n\n>an optimizer.\n\nI tried using one, another guy recommended it but it was too damn complicated to me😅",
        "date": "2024-01-29T14:51:08"
    },
    {
        "comment": "Her ascension stat is ER too lol, she only needs ~3-4 ER rolls to hit 220 with the Catch + atk% sands",
        "date": "2024-01-29T14:15:47"
    },
    {
        "comment": ">Trying to make up 50%\n\nAre you assuming she's level 60 or something? With catch and emblem she's at like 200ER. You need like 3 or 4 rolls to hit 220. I don't think that's hamstringing your crit lol",
        "date": "2024-01-29T14:33:09"
    },
    {
        "comment": "I have 254 ER with Catch, she still has to get her last ascension btw.\n\nCan you give me a link for a Optimizer?",
        "date": "2024-01-29T13:52:11"
    },
    {
        "comment": "https://frzyc.github.io/genshin-optimizer/",
        "date": "2024-01-29T14:00:18"
    },
    {
        "comment": "What team and what weapon? Catch + Furina + Yelan - Atk goblet can be okay. Otherwise electro is almost always better.",
        "date": "2024-01-29T14:40:48"
    },
    {
        "comment": "I was thinking of Raiden(with catch), Chevreuse, XL and Bennet",
        "date": "2024-01-29T14:41:39"
    },
    {
        "comment": "Always Electro, you get atk buffs from Benny, Chev and Pyro resonance",
        "date": "2024-01-29T14:42:08"
    },
    {
        "comment": "So atk sand, Electro goblet and crit circlet👍",
        "date": "2024-01-29T14:46:34"
    },
    {
        "comment": "I have farmed for Raiden Shogun and I got very lucky with the Artifacts, but now I'm quite confused which Sands is better or not.\nI have her signature Weapon.\n\nThe one with ER gives me: 2460~ ATK, 310% ER, 131% Electro Damage.\n\nThe one with ATK% gives: 2770~ ATK, 275%, 117% Electro Damage.\n\nBoth gives me the same Crit Rate and Crit Damage (50%/120%)\n\nWhich one performs better?",
        "date": "2024-01-29T09:15:37"
    },
    {
        "comment": "You'll want to plug those stats into an optimizer for specific questions like this\n\nhttps://frzyc.github.io/genshin-optimizer/",
        "date": "2024-01-29T09:23:07"
    },
    {
        "comment": "What team are you running her in? If you have Bennett or Sara or especially both, EM% will almost always be more valuable due to the massive external Atk% buffs you'll be getting.",
        "date": "2024-01-29T09:29:58"
    },
    {
        "comment": "Both, Bennett (Noblesse) and Sara (Severed Fate). The 4th will be Kazuha (or Chevreuse if I want to change for a bit)",
        "date": "2024-01-29T09:34:24"
    },
    {
        "comment": "EM will almost certainly be better, but if you already have both you can always just go beat on that big Vishap five or six times (to account for crit variance) with each and it'll give you a pretty clear indicator on which is hitting better DPS numbers.",
        "date": "2024-01-29T09:39:24"
    },
    {
        "comment": "second one",
        "date": "2024-01-29T15:03:06"
    },
    {
        "comment": "I'm currently AR29 and using a team of Raiden, xiangling, c2 Bennett and Lynette. I've just seen the event that I can get xingqiu from so I will get him for that team. I'm looking to get nahida from the next banner so what sort of starter team should I look to build around her to start clearing abyss From floor 5?",
        "date": "2024-01-29T11:56:12"
    },
    {
        "comment": "who else do you have?",
        "date": "2024-01-29T11:58:47"
    }
]